# MANIPULATING DATA

We first import the NYC taxi dataset

In [67]:
import datetime
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data = pd.read_csv('data/nyc_data.csv', parse_dates=['pickup_datetime', 'dropoff_datetime'])
fare = pd.read_csv('data/nyc_fare.csv', parse_dates=['pickup_datetime'])

In [3]:
data.head()

,medallion,hack_license,vendor_id,rate_code,store_and_fwd_flag,pickup_datetime,dropoff_datetime,passenger_count,trip_time_in_secs,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude
0,76942C3205E17D7E7FE5A9F709D16434,25BA06A87905667AA1FE5990E33F0E2E,VTS,1,NaN,2013-01-01 00:00:00,2013-01-01 00:05:00,3,300,0.61,-73.955925,40.781887,-73.963181,40.777832
1,517C6B330DBB3F055D007B07512628B3,2C19FBEE1A6E05612EFE4C958C14BC7F,VTS,1,NaN,2013-01-01 00:05:00,2013-01-01 00:21:00,1,960,3.28,-74.005501,40.745735,-73.964943,40.755722
2,ED15611F168E41B33619C83D900FE266,754AEBD7C80DA17BA1D81D89FB6F4D1D,CMT,1,N,2013-01-01 00:05:52,2013-01-01 00:12:18,1,386,1.50,-73.969955,40.799770,-73.954567,40.787392
3,B33E704CC189E80C9671230C16527BBC,6789C77E1CBDC850C450D72204702976,VTS,1,NaN,2013-01-01 00:06:00,2013-01-01 00:06:00,6,0,0.00,-73.991432,40.755081,-73.991417,40.755085
4,BD5CC6A22D05EB2D5C8235526A2A4276,5E8F2C93B5220A922699FEBAFC2F7A54,VTS,1,NaN,2013-01-01 00:06:00,2013-01-01 00:12:00,2,360,1.31,-73.966225,40.773716,-73.955399,40.782597

In [4]:
fare.tail()

,medallion,hack_license,vendor_id,pickup_datetime,payment_type,fare_amount,surcharge,mta_tax,tip_amount,tolls_amount,total_amount
846940,9F29B1D177C67F2731E69EAA85D49367,5500334F780132AC7D883F01F869212E,CMT,2013-12-31 23:51:41,CRD,7.0,0.5,0.5,1.6,0.0,9.6
846941,C76AB9E3B27A5CC4F7087CFB109F51AE,6B8BA824723DE0DAB63B980B1DC843CE,CMT,2013-12-31 23:54:00,CSH,28.0,0.5,0.5,0.0,0.0,29.0
846942,D87EB3AD2ED303B3D92E37D871B2C2E9,F578F0435B49B3D7B9A7AAFC663A82CD,VTS,2013-12-31 23:59:00,CSH,8.5,0.5,0.5,0.0,0.0,9.5
846943,F74743D90F84644B1FA4576F4A82A8A3,537121DB04EC62BADFA44D8F03755A64,VTS,2013-12-31 23:59:00,CRD,7.5,0.5,0.5,1.0,0.0,9.5
846944,E5DCEBA68A6094576B10AFC609C61E29,735F78FA4CB06B5CB7122FF31822F68E,CMT,2013-12-31 23:59:24,CSH,19.0,0.5,0.5,0.0,0.0,20.0

## Selecting data

### Selecting columns

In [5]:
data[['trip_distance', 'trip_time_in_secs']].head(6)

   trip_distance  trip_time_in_secs
0           0.61                300
1           3.28                960
2           1.50                386
3           0.00                  0
4           1.31                360
5           5.81               1620

### Selecting rows

The ``loc`` attribute of a DataFrame is used to select row(s) from their labels. Here, we select the first row:

In [6]:
data.loc[0]

medallion             76942C3205E17D7E7FE5A9F709D16434
hack_license          25BA06A87905667AA1FE5990E33F0E2E
vendor_id                                          VTS
rate_code                                            1
store_and_fwd_flag                                 NaN
pickup_datetime                    2013-01-01 00:00:00
dropoff_datetime                   2013-01-01 00:05:00
passenger_count                                      3
trip_time_in_secs                                  300
trip_distance                                     0.61
pickup_longitude                              -73.9559
pickup_latitude                                40.7819
dropoff_longitude                             -73.9632
dropoff_latitude                               40.7778
Name: 0, dtype: object

Multiple rows can be selected by providing a list of labels:

In [7]:
data.loc[[0, 5, 20]]

,medallion,hack_license,vendor_id,rate_code,store_and_fwd_flag,pickup_datetime,dropoff_datetime,passenger_count,trip_time_in_secs,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude
0,76942C3205E17D7E7FE5A9F709D16434,25BA06A87905667AA1FE5990E33F0E2E,VTS,1,NaN,2013-01-01 00:00:00,2013-01-01 00:05:00,3,300,0.61,-73.955925,40.781887,-73.963181,40.777832
5,61E558C4FCB0BCB8562FC37B06B97FFE,76DC5E351A0E646679BCA84B18B37B9A,VTS,1,NaN,2013-01-01 00:07:00,2013-01-01 00:34:00,1,1620,5.81,-73.955238,40.768978,-73.994064,40.720299
20,7257A55FFAB4C29F08A9A40F510FC2B6,E3590A87560D47E221285458CEAC02E2,CMT,1,N,2013-01-01 00:13:38,2013-01-01 00:21:57,1,498,2.50,-73.969917,40.753067,-73.988152,40.722668

We can also select regularly spaced rows using slices.

In [8]:
fare.loc[150000:200000:10000, ['fare_amount', 'total_amount']]

        fare_amount  total_amount
150000          8.5         10.70
160000         31.0         40.83
170000          6.0          6.50
180000         10.0         10.50
190000         20.0         25.62
200000         15.0         15.50

``loc`` expects actual labels and, unlike normal Python slices, the start and end points are both inclusive! Also, we could have used ``iloc`` instead of ``loc`` to specify index positions rather than labels.

In [9]:
fare.iloc[-200:-700:-100][['payment_type', 'surcharge']]

       payment_type  surcharge
846745          CRD        0.5
846645          CSH        0.5
846545          CRD        0.5
846445          CRD        0.5
846345          CSH        0.5

### Filtering with boolean indexing

Instead of selecting rows by labels, we can also select rows satisfying specific properties. This is a more common use-case in data analysis.

In [10]:
data.loc[data.trip_distance > 100]

,medallion,hack_license,vendor_id,rate_code,store_and_fwd_flag,pickup_datetime,dropoff_datetime,passenger_count,trip_time_in_secs,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude
504497,7237EC7ABD6114EDDC87A3AA846F8418,D52502537E2DF62C9BFFECF5A387E7E9,CMT,1,N,2013-08-02 11:22:31,2013-08-02 11:33:03,1,631,6005123.0,-73.997467,40.736397,-73.991882,40.764629
507107,50DA72F510E2F84A42712E13744FAC7B,EA9D03A766C1D32A6668FFF0C1EB4E4B,CMT,1,N,2013-08-04 18:42:17,2013-08-04 20:37:19,3,4290965,181.8,-73.978020,40.765167,-73.815041,40.730076
548988,A978A0AAE9B2CFEE310FACD97A09C319,CE56A27F53ABF411094B6CD708BFBA96,CMT,1,N,2013-08-24 17:03:27,2013-08-24 17:03:29,1,1,442.0,-73.993896,40.702644,-73.993874,40.702637
558665,5A5C516A820FE476E9D3E14101B669AC,C24585AA866FC76A4E09A05F55DC7E54,CMT,2,N,2013-08-29 10:01:40,2013-08-29 11:52:20,1,6640,164.4,-73.791534,40.661026,-73.983734,40.765778

In [11]:
data.loc[[False, True, False, True, True]]

,medallion,hack_license,vendor_id,rate_code,store_and_fwd_flag,pickup_datetime,dropoff_datetime,passenger_count,trip_time_in_secs,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude
1,517C6B330DBB3F055D007B07512628B3,2C19FBEE1A6E05612EFE4C958C14BC7F,VTS,1,NaN,2013-01-01 00:05:00,2013-01-01 00:21:00,1,960,3.28,-74.005501,40.745735,-73.964943,40.755722
3,B33E704CC189E80C9671230C16527BBC,6789C77E1CBDC850C450D72204702976,VTS,1,NaN,2013-01-01 00:06:00,2013-01-01 00:06:00,6,0,0.00,-73.991432,40.755081,-73.991417,40.755085
4,BD5CC6A22D05EB2D5C8235526A2A4276,5E8F2C93B5220A922699FEBAFC2F7A54,VTS,1,NaN,2013-01-01 00:06:00,2013-01-01 00:12:00,2,360,1.31,-73.966225,40.773716,-73.955399,40.782597

Creating a slider displaying rows with a distance larger than the threshold:

In [12]:
from ipywidgets import interact

In [13]:
@interact
def show_rows(distance_threshold=(55, 255, 20)):
    return data.loc[data.trip_distance > distance_threshold]

More selection, indexing, and filtering facilities are described in pandas' documentation. Here are a few references:
* http://pandas.pydata.org/pandas-docs/stable/dsintro.html
* http://pandas.pydata.org/pandas-docs/stable/indexing.html

## Computing with numbers

``pandas`` allows you to perform vector operations on DataFrame and Series objects. These operations are quite natural, because they follow standard mathematical notations.

In [14]:
data['trip_time_in_mins'] = data.trip_time_in_secs / 60.0
data[['trip_time_in_secs', 'trip_time_in_mins']].head(6)

   trip_time_in_secs  trip_time_in_mins
0                300           5.000000
1                960          16.000000
2                386           6.433333
3                  0           0.000000
4                360           6.000000
5               1620          27.000000

A Series object is a vector with indices (or labels). The indices determine which values are used when operating Series objects together

In [15]:
a = data.trip_distance[: 5]
a

0    0.61
1    3.28
2    1.50
3    0.00
4    1.31
Name: trip_distance, dtype: float64

In [16]:
b = data.trip_distance[2: 6]
b

2    1.50
3    0.00
4    1.31
5    5.81
Name: trip_distance, dtype: float64

These two Series objects have different but overlapping sets of indices. Although they don't have the same size, we can add them together:

In [18]:
a + b

0     NaN
1     NaN
2    3.00
3    0.00
4    2.62
5     NaN
Name: trip_distance, dtype: float64

The result is a new ``Series`` object containing the *aligned* sum of ``a`` and ``b``. The set of indices of ``a + b`` is the *union* of the indices of ``a`` and ``b``. When one value is missing, we get an operation with an undefined value, which is ``NaN`` (Not a Number). When the indices overlap, the sum is correctly computed. This feature - **alignment** - makes it quite convenient to operate on labeled data. You'll find more information at http://pandas.pydata.org/pandas-docs/stable/basics.html.

Other mathematical operations (+, *, etc.) work similarly. Further, NumPy implements many mathematical functions like ``np.log()`` and ``np.sin()``; they not only work on scalar numbers but also on ``Series`` and ``DataFrames``. This is called **vectorization**, because this concept relates to mathematical operations performed on vectors.

## Working with text

Efficient vectorized operations can also be done on text.

In [19]:
data.medallion.head(4)

0    76942C3205E17D7E7FE5A9F709D16434
1    517C6B330DBB3F055D007B07512628B3
2    ED15611F168E41B33619C83D900FE266
3    B33E704CC189E80C9671230C16527BBC
Name: medallion, dtype: object

The ``str`` attribute gives us access to many vectorized string processing functions.

In [26]:
data.medallion.str.pad(36, side='both', fillchar='0').head(4)

0    0076942C3205E17D7E7FE5A9F709D1643400
1    00517C6B330DBB3F055D007B07512628B300
2    00ED15611F168E41B33619C83D900FE26600
3    00B33E704CC189E80C9671230C16527BBC00
Name: medallion, dtype: object

There are many other functions, including ones that apply regular expressions on all rows. Together, these functions are essential when you're working with text data, particularly when you have datasets so large that for loops would be too slow. You will find the full list of string methods at http://pandas.pydata.org/pandas-docs/stable/text.html.

## Working with dates and times

The ``dt`` attribute of datetime objects gives us access to datetime components. For example, here is how to get the day of the week of the taxi trips (Monday=0, Sunday=6):

In [25]:
data.pickup_datetime.dt.dayofweek[10000 : 20000 : 2000]

10000    5
12000    6
14000    0
16000    1
18000    2
Name: pickup_datetime, dtype: int64

Here is a more complex example. Let's select all night trips that finished the next day:

In [44]:
day_pick = data.pickup_datetime.dt.date
day_drop = data.dropoff_datetime.dt.date
selection = ((day_drop - day_pick).dt.days == 1)
print(len(data.loc[selection]))
data.loc[selection].head(6)

7716
846945

,medallion,hack_license,vendor_id,rate_code,store_and_fwd_flag,pickup_datetime,dropoff_datetime,passenger_count,trip_time_in_secs,trip_distance,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,trip_time_in_mins,daydiff
2005,6385CA8C99985BFBAFB477A9BDFA28C9,08A78365909D2F09BF72B869C0B21FED,VTS,1,NaN,2013-01-01 23:45:00,2013-01-02 00:03:00,1,1080,12.61,-73.873062,40.774128,-73.983597,40.721539,18.000000,1
2008,D932DC772B89F69D30F03FB095424F97,F5AE2E36090433DFE4142AFC19AFD495,CMT,1,N,2013-01-01 23:46:22,2013-01-02 00:28:01,1,2498,16.10,-73.781921,40.644657,-73.998512,40.660194,41.633333,1
2010,33BB4B9DBFD87B7522909FEEB84896F4,412253C6258AF9DCE2D27DE714A84049,CMT,1,N,2013-01-01 23:46:53,2013-01-02 00:03:33,1,1000,5.40,-74.001274,40.725952,-73.980347,40.660503,16.666667,1
2013,66B35E773D495CB81C738625A33C619D,540881FB05E698CCB354C51563FF34FD,CMT,1,N,2013-01-01 23:49:24,2013-01-02 00:04:37,1,912,5.30,-73.989853,40.734402,-73.973595,40.795391,15.200000,1
2017,810905D65B788A8EAA8E15FBE4BB92E1,4DAAB407406B1744FA866E92D612EE29,VTS,1,NaN,2013-01-01 23:57:00,2013-01-02 00:04:00,1,420,1.72,-73.969536,40.785477,-73.986252,40.766983,7.000000,1
2018,D6E912F06EEDB1749B2595C7A1D2901B,F6221366C0C89AD0878A62A2F3BC099B,VTS,1,NaN,2013-01-01 23:58:00,2013-01-02 00:23:00,2,1500,5.49,-73.990562,40.766502,-73.937607,40.795994,25.000000,1

Here are a few references about date and time operations:
* http://pandas.pydata.org/pandas-docs/stable/timeseries.html
* http://pandas.pydata.org/pandas-docs/stable/timedeltas.html

## Handling missing data

In pandas, missing data is represented by ``NaN`` (Not a Number), ``NaT`` (Not a Time) or ``None``. pandas provides several Series and DataFrame methods to deal with missing data, notably:

* ``isnull()`` indicates whether values are null or not
* ``notnull()`` indicates the opposite
* ``dropna()`` removes missing data
* ``fillna(some_default_value)`` replaces missing data with a default value

You will find more details at http://pandas.pydata.org/pandas-docs/stable/missing_data.html.

In [73]:
df = pd.read_csv('test.csv', parse_dates=['Date'])
df

       ID    ANP     DIC    YUE    BEV     Map       Date
0  B09345  456.0    84.0  246.0   87.0  C09452 2017-03-24
1  C09452  557.0  5647.0    NaN  768.0  U34874 2017-03-15
2  U34874  576.0   258.0  642.0    NaN  M94547        NaT
3  M94547  246.0    87.0  577.0  245.0  N39709 2017-04-01
4  N39709    NaN   572.0   87.0    NaN  K04976 2017-04-02
5  K04976  357.0     NaN   27.0  578.0     NaN        NaT

In [74]:
df.loc[pd.isnull(df['ANP'])]

       ID  ANP    DIC   YUE  BEV     Map       Date
4  N39709  NaN  572.0  87.0  NaN  K04976 2017-04-02

In [75]:
df.loc[df['ANP'].isnull()]

       ID  ANP    DIC   YUE  BEV     Map       Date
4  N39709  NaN  572.0  87.0  NaN  K04976 2017-04-02

In [76]:
df.loc[pd.notnull(df['DIC'])]

       ID    ANP     DIC    YUE    BEV     Map       Date
0  B09345  456.0    84.0  246.0   87.0  C09452 2017-03-24
1  C09452  557.0  5647.0    NaN  768.0  U34874 2017-03-15
2  U34874  576.0   258.0  642.0    NaN  M94547        NaT
3  M94547  246.0    87.0  577.0  245.0  N39709 2017-04-01
4  N39709    NaN   572.0   87.0    NaN  K04976 2017-04-02

In [77]:
df.loc[df['DIC'].notnull()]

       ID    ANP     DIC    YUE    BEV     Map       Date
0  B09345  456.0    84.0  246.0   87.0  C09452 2017-03-24
1  C09452  557.0  5647.0    NaN  768.0  U34874 2017-03-15
2  U34874  576.0   258.0  642.0    NaN  M94547        NaT
3  M94547  246.0    87.0  577.0  245.0  N39709 2017-04-01
4  N39709    NaN   572.0   87.0    NaN  K04976 2017-04-02

In [78]:
df.dropna(axis=0)

       ID    ANP   DIC    YUE    BEV     Map       Date
0  B09345  456.0  84.0  246.0   87.0  C09452 2017-03-24
3  M94547  246.0  87.0  577.0  245.0  N39709 2017-04-01

In [79]:
df.dropna(axis=1)

       ID
0  B09345
1  C09452
2  U34874
3  M94547
4  N39709
5  K04976

In [80]:
df.Date.fillna(datetime.date.today(), inplace=True)
df

       ID    ANP     DIC    YUE    BEV     Map       Date
0  B09345  456.0    84.0  246.0   87.0  C09452 2017-03-24
1  C09452  557.0  5647.0    NaN  768.0  U34874 2017-03-15
2  U34874  576.0   258.0  642.0    NaN  M94547 2017-04-07
3  M94547  246.0    87.0  577.0  245.0  N39709 2017-04-01
4  N39709    NaN   572.0   87.0    NaN  K04976 2017-04-02
5  K04976  357.0     NaN   27.0  578.0     NaN 2017-04-07

In [82]:
df.BEV.fillna(df.BEV.mean(), inplace=True)
df

       ID    ANP     DIC    YUE    BEV     Map       Date
0  B09345  456.0    84.0  246.0   87.0  C09452 2017-03-24
1  C09452  557.0  5647.0    NaN  768.0  U34874 2017-03-15
2  U34874  576.0   258.0  642.0  419.5  M94547 2017-04-07
3  M94547  246.0    87.0  577.0  245.0  N39709 2017-04-01
4  N39709    NaN   572.0   87.0  419.5  K04976 2017-04-02
5  K04976  357.0  1329.6   27.0  578.0     NaN 2017-04-07